base/Catalogs/бит_фн_Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_фн_Оповещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Comment>Пользовательское условие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Comment>Вид события</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_фн_ВидыСобытийОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза</Name>
					<Comment>Виза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Comment>Решение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРешенийСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Comment>Шаблон сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_фн_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаДоставки</Name>
					<Comment>Настройка доставки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_фн_НастройкиДоставкиОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДляПроверки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновщика</Name>
					<Comment>Хранит настройки компоновщика</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФоновыйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьПовторно</Name>
					<Comment>Не регистрировать повторно</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
					<Comment>Получатели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Пользователь</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Comment>Вид контактной информации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеВхождения</Name>
							<Comment>Условие вхождения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Comment>Шаблон сообщения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_фн_ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаДоставки</Name>
							<Comment>Настройка доставки</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_фн_НастройкиДоставкиОповещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательскоеУсловие</Name>
							<Comment>Пользовательское условие</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоздаватьОбсуждение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_ВидыСравненияТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыСравненияТрансляции</Name>
			<Comment>Виды сравнения трансляции</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппе</Name>
					<Comment>В группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НЕВГруппе</Name>
					<Comment>НЕ в группе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСодержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВСписке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВГруппеИзСписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_фн_Оповещения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьОтборыДинамическихСписков();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("НастройкиКомпоновщика", Компоновщик.ПолучитьНастройки());
	ТекущийОбъект.СохранитьНастройкиКомпоновщика(СтруктураНастройки);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДоработатьТаблицуПолучатели(ТекущийОбъект);
	УстановитьОтборыДинамическихСписков();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектСистемы) Тогда
		
		// Проверим соответствует ли объект системы виду события.
		Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник") 
			И НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник") Тогда
			
			Объект.ОбъектСистемы = Неопределено;
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи") 
			И НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача") Тогда
			
			Объект.ОбъектСистемы = Неопределено;
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса") 
			И НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.БизнесПроцесс") Тогда
			
			Объект.ОбъектСистемы = Неопределено;
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования") Тогда
			
			Объект.ОбъектСистемы = Неопределено;
		ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененаДатаПлатежа")
			И НЕ Объект.ОбъектСистемы = ПлатежнаяПозиция Тогда
			
			Объект.ОбъектСистемы = Неопределено;
		Иначе	
			Если НЕ ВидОбъектаСистемы = ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ") Тогда
				Объект.ОбъектСистемы = Неопределено;
			КонецЕсли; 
			
			Если ОграничитьСписокОбъектов() Тогда
				Если КэшЗначений.СписокВизируемыхОбъектов.НайтиПоЗначению(Объект.ОбъектСистемы) = Неопределено Тогда
					Объект.ОбъектСистемы = Неопределено;
				КонецЕсли; 
			КонецЕсли; // Проверка на вхождение в список визируемых.
		КонецЕсли; // По виду события.
		
	КонецЕсли;
	
	ВидСобытияИзменение();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ВидСобытия".
// 
&НаСервере
Процедура ВидСобытияИзменение()
	
	УстановитьОбъектПоВидуСобытия();
	ИзменениеОбъектаСистемы();
	ИнициализироватьКомпоновщик();
	УстановитьВидимость();
	
КонецПроцедуры

// Функция определяет необходимость инициализации компоновщика.
//
// Возвращаемое значение:
//  Результат - Булево.
//
&НаСервере
Функция НеобходимоИнициализироватьКомпоновщик()

	Результат = Ложь;
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуНачислений
			ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуПлатежей
			ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора
			ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате Тогда
			
			Результат = Истина;
		КонецЕсли;	
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда
		Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора
			ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции // НеобходимоИнициализироватьКомпоновщик()

// Процедура инциализирует компоновщик.
// 
// Параметры:
// 
&НаСервере
Процедура ИнициализироватьКомпоновщик()

	Если НеобходимоИнициализироватьКомпоновщик() Тогда

		ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_фн_Оповещения"));
			
		ТекОбъект.ИнициализироватьКомпоновщик(Объект.ВидСобытия, Компоновщик);
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьКомпоновщик()

// Процедура - обработчик события "НачалоВыбора" поля ввода "ОбъектСистемы".
// 
&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВидовОбъектов = Новый СписокЗначений;
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник") Тогда
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса") Тогда
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.БизнесПроцесс"));
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи") Тогда
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача"));
	// ++ ЕРП
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение") 
		ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") 
		ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДоступнаВиза") Тогда
		
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
	// -- ЕРП
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования") Тогда
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Обработка"));
	Иначе	
		СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   ,Объект.ОбъектСистемы);
	ПараметрыФормы.Вставить("ВидыОбъектов"           ,СписокВидовОбъектов);
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ИзмененаДатаПлатежа") Тогда 
		ДоступныеОбъектыСистемы = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ПлатежнаяПозиция) Тогда			
			ДоступныеОбъектыСистемы.Добавить(ПлатежнаяПозиция);			
		КонецЕсли; 
		ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", ДоступныеОбъектыСистемы);
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования") Тогда	
		ДоступныеОбъектыСистемы = ОбработкиВизирования();
		ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", ДоступныеОбъектыСистемы);
	ИначеЕсли ОграничитьСписокОбъектов() Тогда
		ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", КэшЗначений.СписокВизируемыхОбъектов);	
	КонецЕсли; 	
	
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода "ПользовательскоеУсловие".
// 
&НаКлиенте
Процедура ПользовательскоеУсловиеПриИзменении(Элемент)
	
	ОбновитьДеревоУсловия();
	РазвернутьДерево();	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") Тогда
		СтрокаВыбора = НСтр("ru = '%1 ""%2""'; en = '%1 ""%2""'");
		СтрокаВыбора = СтрШаблон(СтрокаВыбора, 
		                         Объект.ВидСобытия,
								 Объект.Статус);
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение") Тогда
		СтрокаВыбора = НСтр("ru = '%1 ""%2"" по визе ""%3""'; en = '%1 ""%2"" on visa ""%3""'");
		СтрокаВыбора = СтрШаблон(СтрокаВыбора, 
		                         Объект.ВидСобытия,
								 Объект.Решение,
								 Объект.Виза);
	Иначе	
		СтрокаВыбора = НСтр("ru = '%1'; en = '%1'");
		СтрокаВыбора = СтрШаблон(СтрокаВыбора, Объект.ВидСобытия);
	КонецЕсли;
	
	Элемент.СписокВыбора.Добавить(СтрокаВыбора);
	
КонецПроцедуры // НаименованиеНачалоВыбораИзСписка

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") Тогда
		СтрВыбора = НСтр("ru = '%1 ""%2""'; en = '%1 ""%2""'");
		СтрВыбора = СтрШаблон(СтрВыбора, Объект.ВидСобытия, Объект.Статус);
	ИначеЕсли Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение") Тогда	
		СтрВыбора = НСтр("ru = '%1 ""%2"" по визе ""%3""'; en = '%1 ""%2"" on visa ""%3""'");
		СтрВыбора = СтрШаблон(СтрВыбора, Объект.ВидСобытия, Объект.Решение, Объект.Виза);
	Иначе	
		СтрВыбора = НСтр("ru = '%1'; en = '%1'");
		СтрВыбора = СтрШаблон(СтрВыбора, Объект.ВидСобытия);
	КонецЕсли; 
	
	Элемент.СписокВыбора.Добавить(СтрВыбора);
	
КонецПроцедуры // НаименованиеАвтоПодбор()

// Процедура - обработчик события "ПриИзменении" поля ввода "ОбъектСистемы".
// 
&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
  ИзменениеОбъектаСистемы();	
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода "Статус".
// 
&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		// В тонком клиенте действуют параметры выбора.
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СтатусНачалоВыбораЗавершение", ЭтотОбъект);
	
		ПоказатьВыборИзСписка(ОписаниеОповещения, КэшЗначений.СписокДоступныхСтатусов);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура обработчик оповещения "СтатусНачалоВыбораЗавершение".
// 
// Параметры:
// ВыбранноеЗначение - Произвольный.
// ДополнительныеПараметры - Структура.
// 
&НаКлиенте
Процедура СтатусНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Объект.Статус = ВыбранноеЗначение.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрОтбор = Новый Структура;
	
	Если КэшЗначений.ШапкаСпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта") 
		ИЛИ КэшЗначений.ШапкаСпособТранспорта = ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта1С") Тогда
		СпособТранспортаОтбор = Новый СписокЗначений;
		СпособТранспортаОтбор.Добавить(ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта"));
		СпособТранспортаОтбор.Добавить(ПредопределенноеЗначение("Перечисление.бит_фн_СпособыТранспортаОповещений.ЭлектроннаяПочта1С"));
		
		СтрОтбор.Вставить("СпособТранспорта", СпособТранспортаОтбор);
	Иначе
		СтрОтбор.Вставить("СпособТранспорта", КэшЗначений.ШапкаСпособТранспорта);
	КонецЕсли;
	
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтрОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДоставкиПриИзменении(Элемент)
	НастройкаДоставкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастройкаДоставкиПриИзмененииНаСервере()
	
	КэшЗначений.ШапкаСпособТранспорта = Объект.НастройкаДоставки.СпособТранспорта;
	
	Если НЕ Объект.ШаблонСообщения.СпособТранспорта = Объект.НастройкаДоставки.СпособТранспорта Тогда
	
		 Объект.ШаблонСообщения = Неопределено;
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоУсловия

&НаКлиенте
Процедура ДеревоУсловияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РедактироватьПользовательскоеУсловие();
	РазвернутьДерево();		
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолучатели

&НаКлиенте
Процедура ПолучателиПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтотОбъект
	                                                   ,Элемент
	                                                   ,ТекущиеДанные
	                                                   ,"Пользователь"
													   ,Получатели
													   ,СтандартнаяОбработка);

													   
	Если ТипЗнч(ТекущиеДанные.Пользователь) = Тип("Строка") Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПолучателиПользовательНачалоВыбораЗавершение", ЭтотОбъект, ТекущиеДанные);
		
		ПоказатьВыборИзСписка(ОписаниеОповещения, КэшЗначений.СписокВыражений);
		
	КонецЕсли; 												   
													   
КонецПроцедуры

// Процедура обработчик оповещения "ПолучателиПользовательНачалоВыбораЗавершение".
// 
// Параметры:
// ВыбЗначение - Произвольный
// ТекущиеДанные - Структура
// 
&НаКлиенте
Процедура ПолучателиПользовательНачалоВыбораЗавершение(ВыбЗначение, ТекущиеДанные) Экспорт
	
	Если НЕ ВыбЗначение = Неопределено Тогда
		
		ТекущиеДанные.Пользователь = ВыбЗначение.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПользовательОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПользовательПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидКонтактнойИнформации) И ЗначениеЗаполнено(ТекущиеДанные.Пользователь) Тогда
		
		Если ТипЗнч(ТекущиеДанные.Пользователь) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТекущиеДанные.ВидКонтактнойИнформации = КэшЗначений.ВидКонтактнойИнформацииПочтаКонтрагента;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Пользователь) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ТекущиеДанные.ВидКонтактнойИнформации = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
		Иначе	
			ТекущиеДанные.ВидКонтактнойИнформации = КэшЗначений.ВидКонтактнойИнформацииСлужебнаяПочта;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиШаблонСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Получатели.ТекущиеДанные;
	
	СтрОтбор = Новый Структура;
	СтрОтбор.Вставить("СпособТранспорта", ТекущаяСтрока.СпособТранспорта);
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтрОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиНастройкаДоставкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Получатели.ТекущиеДанные;
	ТекущаяСтрока.СпособТранспорта = ПолучателиНастройкаДоставкиПриИзмененииНаСервере(ТекущаяСтрока.НастройкаДоставки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучателиНастройкаДоставкиПриИзмененииНаСервере(Знач НастройкаДоставки)
	
	 Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаДоставки, "СпособТранспорта");
	 
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНазначениеОповещений

&НаКлиенте
Процедура НазначениеОповещенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Параметры.Ключ.Пустая() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,НСтр("ru='Необходимо записать элемент.';en='You need to write element.'"));
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "РедактироватьУсловие".
// 
&НаКлиенте
Процедура КомандаРедактироватьУсловие(Команда)
	
	РедактироватьПользовательскоеУсловие();
	РазвернутьДерево();		
	
КонецПроцедуры

// Процедура - обработчик команды "ОбновитьДеревоУсловий".
// 
&НаКлиенте
Процедура КомандаОбновитьДеревоУсловий(Команда)
	
	ОбновитьДеревоУсловия();
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНазначение(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Оповещение",	Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("ВидСобытия",	Объект.ВидСобытия);
	ЗначенияЗаполнения.Вставить("ОбъектСистемы",Объект.ОбъектСистемы);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("РегистрСведений.бит_фн_НазначениеОповещений.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Получим список доступных видов контактной информации.
	// ++ ЕРП
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	|	ВидыКонтактнойИнформации.Наименование КАК Наименование,
	|	ВидыКонтактнойИнформации.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И (ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникПользователи)
	|			ИЛИ ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникКонтрагенты)
	|			ИЛИ ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица))";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекНаименование = "";
		Если Выборка.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникПользователи Тогда
			ТекНаименование = "Пользователь."+Выборка.Наименование;
		ИначеЕсли Выборка.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтрагенты Тогда	
			ТекНаименование = "Контрагент."+Выборка.Наименование;
		ИначеЕсли Выборка.Родитель = Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица Тогда	
			ТекНаименование = "ФизЛицо."+Выборка.Наименование;


		КонецЕсли; 
		Элементы.ПолучателиВидКонтактнойИнформации.СписокВыбора.Добавить(Выборка.Ссылка,ТекНаименование);
	КонецЦикла; 
	// -- ЕРП
	
	ДоработатьТаблицуПолучатели(Объект);
	УстановитьПараметрыВыбораСтатуса();																		
	
	// Связь параметра выбора шаблона сообщения по виду события.
	бит_ОбщегоНазначения.УстановитьСвязьПараметраВыбораЭлемента(Элементы.ШаблонСообщения,
		"Отбор.ВидСобытия", "Объект.ВидСобытия", РежимИзмененияСвязанногоЗначения.Очищать);
																			
	бит_ОбщегоНазначения.УстановитьСвязьПараметраВыбораЭлемента(Элементы.ТочкаАлгоритма,
		"Отбор.Владелец", "Объект.АлгоритмПроцесса", РежимИзмененияСвязанногоЗначения.Очищать);																		
	
	Если НеобходимоИнициализироватьКомпоновщик() Тогда
		ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.бит_фн_Оповещения"));
		ТекОбъект.ИнициализироватьКомпоновщик(Объект.ВидСобытия, Компоновщик);
		СохраненнаяНастройка = ТекОбъект.ПолучитьНастройкиКомпоновщика();
		Если ЗначениеЗаполнено(СохраненнаяНастройка)
			И (СохраненнаяНастройка.НастройкиКомпоновщика.Отбор.Элементы.Количество() > 0
			ИЛИ СохраненнаяНастройка.НастройкиКомпоновщика.Порядок.Элементы.Количество() > 0) Тогда
			Компоновщик.ЗагрузитьНастройки(СохраненнаяНастройка.НастройкиКомпоновщика);
		КонецЕсли; 
	КонецЕсли;
		
	КэшЗначений = Новый Структура;
	
	// Вид контактной информации.
	КэшЗначений.Вставить("ВидКонтактнойИнформацииСлужебнаяПочта",Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	// ++ ЕРП
	КэшЗначений.Вставить("ВидКонтактнойИнформацииПочтаКонтрагента",Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);		
	// -- ЕРП
		
	// Список объектов на которые распространяется механизм визирования.
	СписокВизируемыхОбъектов = бит_ВизированиеСервер.ВизируемыеОбъектыСистемы();
	КэшЗначений.Вставить("СписокВизируемыхОбъектов",СписокВизируемыхОбъектов);
	КэшЗначений.Вставить("СписокВыражений",Новый СписокЗначений);
	КэшЗначений.СписокВыражений = СформироватьСписокВыражений();
	
	СписокДоступныхСтатусов = ДоступныеСтатусы();
	КэшЗначений.Вставить("СписокДоступныхСтатусов", СписокДоступныхСтатусов);
	КэшЗначений.Вставить("ШапкаСпособТранспорта", Объект.НастройкаДоставки.СпособТранспорта);
	ОбновитьДеревоУсловия();
	
	Менеджер = Метаданные.Справочники; 
	Получатели.Добавить(Тип("СправочникСсылка.Пользователи"),		Менеджер.Пользователи.Представление());
	Получатели.Добавить(Тип("СправочникСсылка.ГруппыПользователей"),Менеджер.ГруппыПользователей.Представление());	
	Получатели.Добавить(Тип("СправочникСсылка.Контрагенты"),		Менеджер.Контрагенты.Представление());	
	Получатели.Добавить(Тип("СправочникСсылка.ФизическиеЛица"), 	Менеджер.ФизическиеЛица.Представление());		
	Получатели.Добавить(Тип("Строка"),								НСтр("ru = 'Строка'; en = 'String'"));
	Получатели.Добавить(Тип("СправочникСсылка.бит_ПользовательскиеФункции"),
								Менеджер.бит_ПользовательскиеФункции.Представление());
								
	// ++ ЕРП
	ПлатежнаяПозиция = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Документы.бит_кзн_ПлатежнаяПозиция);
	// -- ЕРП

КонецПроцедуры // ПодготовитьФормуНаСервере()

// Процедура 
// 
// Параметры:
//  Параметр1 - Строка.
// 
&НаСервере
Процедура КопироватьКоллекциюЭлементовОтбора(КоллекцияИсточник, КоллекцияПриемник)

	Для каждого ЭлОтбор Из КоллекцияИсточник Цикл
		
		Если ТипЗнч(ЭлОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ЭлОтборНовый = КоллекцияПриемник.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлОтборНовый, ЭлОтбор);
			
		ИначеЕсли ТипЗнч(ЭлОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда	
			
			ГрОтборНовый = КоллекцияПриемник.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ГрОтборНовый, ЭлОтбор);
			КопироватьКоллекциюЭлементовОтбора(ЭлОтбор.Элементы, ГрОтборНовый.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // КопироватьКоллекциюЭлементовОтбора()

&НаСервереБезКонтекста
Функция НеРегистрироватьПовторноПоВидуСобытия(ВидСобытия)
	
	Результат =  Ложь;
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ДоступнаВиза);
	ВидыСобытий.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанДокумент);
	ВидыСобытий.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ЗаписанСправочник);
 	ВидыСобытий.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора);
	ВидыСобытий.Добавить(Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате);

	Если ВидыСобытий.Найти(ВидСобытия) <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции 

// Процедура устанавливает видимость элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	ЭтоИзменениеСтатуса = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.УстановленСтатус,Истина,Ложь);
	ЭтоУстановленаВиза  = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ПринятоРешение,Истина,Ложь);
	ЭтоДоступнаВиза     = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДоступнаВиза,Истина,Ложь);
	НеРегистрироватьПовторно = НеРегистрироватьПовторноПоВидуСобытия(Объект.ВидСобытия);
	
	Если НЕ Элементы.Статус.Видимость = ЭтоИзменениеСтатуса Тогда
		Элементы.Статус.Видимость  = ЭтоИзменениеСтатуса;		
	КонецЕсли; 
	
	Элементы.Виза.Видимость    = ЭтоУстановленаВиза ИЛИ ЭтоДоступнаВиза;
	Элементы.Решение.Видимость = ЭтоУстановленаВиза;

	ЭтоИзменениеСостоянияПроцесса = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса,Истина,Ложь);
	ЭтоИзменениеСостоянияЗадачи   = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи,Истина,Ложь);
	
	Элементы.АлгоритмПроцесса.Видимость = ЭтоИзменениеСостоянияПроцесса
										ИЛИ ЭтоИзменениеСостоянияЗадачи;
										
	Элементы.ТочкаАлгоритма.Видимость = ЭтоИзменениеСостоянияЗадачи;
	
	Элементы.Статус.Видимость = ЭтоИзменениеСтатуса
								ИЛИ ЭтоИзменениеСостоянияПроцесса
								ИЛИ ЭтоИзменениеСостоянияЗадачи;
								
	ЭтоДокументыДляВизирования = ?(Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования,Истина,Ложь);
	
	Элементы.ГруппаСтраницаУсловие.Видимость = НЕ ЭтоДокументыДляВизирования;
	
	
	Если ЭтоИзменениеСостоянияПроцесса
		ИЛИ ЭтоИзменениеСостоянияЗадачи Тогда
		Элементы.Статус.Заголовок = НСтр("ru = 'Состояние'");
	Иначе
		Элементы.Статус.Заголовок = НСтр("ru = 'Статус'");
	КонецЕсли;
	
	Если НеобходимоИнициализироватьКомпоновщик() Тогда
		
		Элементы.ГруппаСтраницаНастройкаОтбора.Видимость = Истина;
		Элементы.ГруппаСтраницаУсловие.Видимость = Ложь;
		Элементы.ОбъектСистемы.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.ГруппаСтраницаУсловие.Видимость = НЕ ЭтоДокументыДляВизирования;
		Элементы.ГруппаСтраницаНастройкаОтбора.Видимость = Ложь;
		Элементы.ОбъектСистемы.ТолькоПросмотр = Ложь;

	КонецЕсли;
	
	Элементы.ФоновыйРежим.Видимость = ЭтоДоступнаВиза;
	Элементы.НеРегистрироватьПовторно.Видимость = НеРегистрироватьПовторно;
	Элементы.НеРегистрироватьПовторно.ОтображениеПодсказки = ?(ЭтоДоступнаВиза, ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет);
	
	ДоступноСоздаватьОбсуждение = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		Если ОбсужденияСлужебныйВызовСервера.Подключены() Тогда
			ДоступноСоздаватьОбсуждение = Истина;
		КонецЕсли; 
	КонецЕсли; 

	Элементы.ПолучателиСоздаватьОбсуждение.Видимость = ДоступноСоздаватьОбсуждение;
	
КонецПроцедуры // УстановитьВидимость()

// Процедура обновляет дерево условий, отображающее структуру пользовательского условия.
// 
&НаСервере
Процедура ОбновитьДеревоУсловия()
	
	ДанныеДерева = ДеревоУсловия.ПолучитьЭлементы();
	ДанныеДерева.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ПользовательскоеУсловие) Тогда
		
		Для каждого СтрокаТаблицы Из Объект.ПользовательскоеУсловие.Условия Цикл
			
			ЭлементДерева = ДанныеДерева.Добавить();
			ЭлементДерева.ВидСтроки = "Условие";
			ЗаполнитьЗначенияСвойств(ЭлементДерева,СтрокаТаблицы);
			
			СтрОтбор = Новый Структура("ИД_Условия",СтрокаТаблицы.ИД);
			
			МассивСтрокПараметров = Объект.ПользовательскоеУсловие.ПараметрыУсловий.НайтиСтроки(СтрОтбор);
			
			Если МассивСтрокПараметров.Количество() > 0  Тогда
				
		       КоллекцияЭлементовВерх = ЭлементДерева.ПолучитьЭлементы();
				
				Для каждого СтрокаПараметр Из МассивСтрокПараметров Цикл
					
					ЭлементДереваПараметр = КоллекцияЭлементовВерх.Добавить();
					ЭлементДереваПараметр.Свойство = СтрокаПараметр.Имя;
					ЭлементДереваПараметр.ВидСравнения = Перечисления.бит_ВидыСравненияТрансляции.Равно;
					ЭлементДереваПараметр.ВидСтроки = "Параметр";
					ЭлементДереваПараметр.ИД        = СтрокаПараметр.ИД_Условия;
					ЭлементДереваПараметр.Значение  = СтрокаПараметр.Значение;
					
				КонецЦикла; // По параметрам условия
				
			КонецЕсли;// Есть параметры
			
		КонецЦикла; // По таблице условий
	
	КонецЕсли; 
	
КонецПроцедуры // ОбновитьДеревоУсловия()

// Процедура открывает форму редактирования пользовательского условия.
// 
&НаКлиенте
Процедура РедактироватьПользовательскоеУсловие()
	
	ПользовательскоеУсловие = Объект.ПользовательскоеУсловие; 
	
	Если ЗначениеЗаполнено(ПользовательскоеУсловие) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ПользовательскоеУсловие);
		
		Обработчик = Новый ОписаниеОповещения("РедактироватьПользовательскоеУсловиеЗавершение", ЭтотОбъект);
		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,, Обработчик, Режим);
		
	КонецЕсли; 
	
КонецПроцедуры // РедактироватьПользовательскоеУсловие()

// Процедура обработчик оповещения "РедактироватьПользовательскоеУсловиеЗавершение".
// 
// Параметры:
// Результат - Произвольный.
// ДополнительныеПараметры - Структура.
// 
&НаКлиенте
Процедура РедактироватьПользовательскоеУсловиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	  ОбновитьДеревоУсловия();	
	
КонецПроцедуры

// Процедура обрабатывает изменение объекта системы.
// 
&НаСервере
Процедура ИзменениеОбъектаСистемы()
	
	КэшЗначений.СписокВыражений = СформироватьСписокВыражений();
	
	КэшЗначений.СписокДоступныхСтатусов = ДоступныеСтатусы();
	
	НайденноеЗначение = КэшЗначений.СписокДоступныхСтатусов.НайтиПоЗначению(Объект.Статус);
	
	Если НайденноеЗначение = Неопределено Тогда
		Объект.Статус = Неопределено;
	КонецЕсли;
	УстановитьПараметрыВыбораСтатуса();
	
КонецПроцедуры // ИзменениеОбъектаСистемы()

// Функция формирует список доступных выражений для вычисления получателя.
// 
// 
&НаСервере
Функция СформироватьСписокВыражений()
	
	СписокВыражений = Новый СписокЗначений;
	СписокВыражений.Добавить("Пользователь","Пользователь");
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(Объект.ОбъектСистемы.ИмяОбъектаПолное);
	
	Переход = Ложь;
	Если НеобходимоИнициализироватьКомпоновщик() Тогда
		СписокВыражений.Добавить("ТекущийОбъект.Контрагент","ТекущийОбъект.Контрагент");
		Переход = Истина;
	КонецЕсли;
	
	Если НЕ МетаОбъект = Неопределено И НЕ Переход Тогда
		Для каждого МетаРеквизит Из МетаОбъект.Реквизиты Цикл
			Если МетаРеквизит.Тип.СодержитТип(Тип("СправочникСсылка.Пользователи")) Тогда
				СписокВыражений.Добавить("ТекущийОбъект."+МетаРеквизит.Имя);
			КонецЕсли; 
		КонецЦикла; 
		
		Если МетаОбъект.Имя = "бит_Задача" Тогда
			СписокВыражений.Добавить("ТекущийОбъект.Исполнитель");
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат СписокВыражений;
	
КонецФункции // СформироватьСписокВыражений()

&НаСервере
Функция ДоступныеСтатусы()
	
	Возврат Справочники.бит_СтатусыОбъектов.ДоступныеСтатусыОбъектаСистемы(Объект.ОбъектСистемы);
	
КонецФункции

// Процедура заполняет реквизит ОбъектСистемы некоторым значением по-умолчания для текущего вида события.
// 
&НаСервере
Процедура УстановитьОбъектПоВидуСобытия()
	
	Если Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования Тогда
		
		МетаОбъект = Метаданные.Обработки.бит_КонсольОперативногоВизирования;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеПроцесса Тогда
		
		МетаОбъект = Метаданные.БизнесПроцессы.бит_Процесс;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи Тогда
		
		МетаОбъект = Метаданные.Задачи.бит_Задача;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);	
		
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуНачислений  
		       ИЛИ Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуПлатежей Тогда

			   Если бит_РаботаСМетаданными.ЕстьДокумент("бит_ДополнительныеУсловияПоДоговору")	Тогда   
				   МетаОбъект = Метаданные.Документы.бит_ДополнительныеУсловияПоДоговору;
				   Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
			   КонецЕсли;
		
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора Тогда

		МетаОбъект = Метаданные.Справочники.ДоговорыКонтрагентов;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		
	ИначеЕсли Объект.ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияОбОплате Тогда

		МетаОбъект = Метаданные.Документы.бит_кзн_ПлатежнаяПозиция;
		Объект.ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет колонку СпособТранспорта таблицы Получатели
//
&НаСервере
Процедура ДоработатьТаблицуПолучатели(ТекОбъект)
	
	Для каждого СтрокаТаблицы Из Объект.Получатели Цикл
		
		СтрокаТаблицы.СпособТранспорта = СтрокаТаблицы.НастройкаДоставки.СпособТранспорта;
		
	КонецЦикла; 
	
КонецПроцедуры // ДоработатьТаблицуПолучатели()

// Процедура разворачивает дерево.
// 
// Параметры:
//  Нет.
// 
&НаКлиенте
Процедура РазвернутьДерево()

	ЭлементыДерева = ДеревоУсловия.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыДерева Цикл

		Элементы.ДеревоУсловия.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ОграничитьСписокОбъектов()

	Результат = Ложь;
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.ПринятоРешение")
		ИЛИ Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.бит_фн_ВидыСобытийОповещений.УстановленСтатус") Тогда
		Результат = Истина;	
	КонецЕсли; 	

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НазначениеОповещения, 
		"Оповещение", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно,, Истина); 

КонецПроцедуры

// Функция - Обработки визирования
// 
// Возвращаемое значение:
//  СписокЗначений - 
//
&НаСервереБезКонтекста
Функция ОбработкиВизирования() 
	
	Результат = Новый СписокЗначений;
	бит_КонсольОперативногоВизирования = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.Обработки.бит_КонсольОперативногоВизирования);
	Результат.Добавить(бит_КонсольОперативногоВизирования);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораСтатуса()

	СтатусыОбъектовСистемы = Новый Массив;
	СтатусыОбъектовСистемы.Добавить(Справочники.бит_ОбъектыСистемы.ПустаяСсылка());
	СтатусыОбъектовСистемы.Добавить(Объект.ОбъектСистемы);
	
	ПараметрыСтатусов = Новый Массив();
	ПараметрыСтатусов.Добавить(Новый ПараметрВыбора("Отбор.Объект", Новый ФиксированныйМассив(СтатусыОбъектовСистемы)));
	Элементы.Статус.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыСтатусов);

КонецПроцедуры

#КонецОбласти
